04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/bubblePipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0.0    0.0    -0.1)
    (0.025 -2.2e-4 -0.1)
    (0.025  2.2e-4 -0.1)
    (0.0    0.0    -0.1)
    (0.0    0.0     0.9)
    (0.025 -2.2e-4  0.9)
    (0.025  2.2e-4  0.9)
    (0.0    0.0     0.9)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 1 200) simpleGrading (0.375 1 1)
);

boundary
(
    inlet
    {
        type mappedInternal;
        offset (0 0 0.05);
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (2 3 7 6)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (3 0 4 7)
        );
    }
);


// ************************************************************************* //
